reports/p14-1/seckill/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /workspace/scripts/seckill_burst.js
        output: -

     scenarios: (100.00%) 1 scenario, 250 max VUs, 2m30s max duration (incl. graceful stop):
              * burst: 1000 iterations shared among 250 VUs (maxDuration: 2m0s, gracefulStop: 30s)


     ✓ business outcome classified

     business_accepted..............: 500     1347.398826/s
     business_duration..............: avg=82.21ms  min=4.05ms med=55.59ms max=281.65ms p(90)=180.58ms p(95)=201.15ms p(99)=245.2ms 
     business_out_of_stock..........: 500     1347.398826/s
     business_rejected..............: 500     1347.398826/s
     checks.........................: 100.00% 1000 out of 1000
     data_received..................: 168 kB  451 kB/s
     data_sent......................: 158 kB  426 kB/s
     http_req_blocked...............: avg=1.73ms   min=375ns  med=2.25µs  max=41.55ms  p(90)=1.98ms   p(95)=10.67ms  p(99)=33.92ms 
     http_req_connecting............: avg=287.16µs min=0s     med=0s      max=23.3ms   p(90)=122.36µs p(95)=280.3µs  p(99)=8.56ms  
   ✓ http_req_duration..............: avg=82.21ms  min=4.05ms med=55.59ms max=281.65ms p(90)=180.58ms p(95)=201.15ms p(99)=245.2ms 
       { expected_response:true }...: avg=82.21ms  min=4.05ms med=55.59ms max=281.65ms p(90)=180.58ms p(95)=201.15ms p(99)=245.2ms 
   ✓ http_req_failed................: 0.00%   0 out of 1000
     http_req_receiving.............: avg=205.44µs min=5.04µs med=34.43µs max=12.68ms  p(90)=350.04µs p(95)=824.82µs p(99)=3.33ms  
     http_req_sending...............: avg=399.39µs min=1.41µs med=6.58µs  max=32.65ms  p(90)=62.75µs  p(95)=191.33µs p(99)=8.74ms  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=81.61ms  min=4.04ms med=55.21ms max=268.95ms p(90)=180.37ms p(95)=201.12ms p(99)=245.17ms
     http_reqs......................: 1000    2694.797652/s
     iteration_duration.............: avg=84.14ms  min=4.1ms  med=56.81ms max=281.79ms p(90)=185.65ms p(95)=211.49ms p(99)=245.35ms
     iterations.....................: 1000    2694.797652/s
   ✓ technical_errors...............: 0.00%   0 out of 1000


running (0m00.4s), 000/250 VUs, 1000 complete and 0 interrupted iterations
burst ✓ [ 100% ] 250 VUs  0m00.4s/2m0s  1000/1000 shared iters